HaLoTaRiS/robot-biere-okdo/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t SENSOR_1_XSHUT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin 6)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_GPIO, BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_PORT, BOARD_INITDEBUG_UARTPINS_SENSOR_1_XSHUT_PIN, &SENSOR_1_XSHUT_config);

    gpio_pin_config_t ULTRASON_2_ECHO_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 71)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_GPIO, BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_PORT, BOARD_INITDEBUG_UARTPINS_ULTRASON_2_ECHO_PIN, &ULTRASON_2_ECHO_config);

    gpio_pin_config_t ULTRASON_2_TRIG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 72)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_GPIO, BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_PORT, BOARD_INITDEBUG_UARTPINS_ULTRASON_2_TRIG_PIN, &ULTRASON_2_TRIG_config);

    gpio_pin_config_t MOTOR_A_DIRECTION_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin 22)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_GPIO, BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PORT, BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PIN, &MOTOR_A_DIRECTION_config);

    gpio_pin_config_t MOTOR_ENABLE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 14)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_GPIO, BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PORT, BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PIN, &MOTOR_ENABLE_config);

    gpio_pin_config_t SWITCH_BIERE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 60)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_SWITCH_BIERE_GPIO, BOARD_INITDEBUG_UARTPINS_SWITCH_BIERE_PORT, BOARD_INITDEBUG_UARTPINS_SWITCH_BIERE_PIN, &SWITCH_BIERE_config);

    gpio_pin_config_t SENSOR_2_XSHUT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 23)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_GPIO, BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PORT, BOARD_INITDEBUG_UARTPINS_SENSOR_2_XSHUT_PIN, &SENSOR_2_XSHUT_config);

    gpio_pin_config_t SENSOR_1_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 11)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_GPIO, BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_PORT, BOARD_INITDEBUG_UARTPINS_SENSOR_1_INT_PIN, &SENSOR_1_INT_config);

    gpio_pin_config_t SENSOR_3_XSHUT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 61)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_GPIO, BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PORT, BOARD_INITDEBUG_UARTPINS_SENSOR_3_XSHUT_PIN, &SENSOR_3_XSHUT_config);

    gpio_pin_config_t LED_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_4 (pin 1)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_LED_RED_GPIO, BOARD_INITDEBUG_UARTPINS_LED_RED_PORT, BOARD_INITDEBUG_UARTPINS_LED_RED_PIN, &LED_RED_config);

    gpio_pin_config_t SENSOR_4_XSHUT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin 31)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_GPIO, BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PORT, BOARD_INITDEBUG_UARTPINS_SENSOR_4_XSHUT_PIN, &SENSOR_4_XSHUT_config);

    gpio_pin_config_t LED_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin 5)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_LED_BLUE_GPIO, BOARD_INITDEBUG_UARTPINS_LED_BLUE_PORT, BOARD_INITDEBUG_UARTPINS_LED_BLUE_PIN, &LED_BLUE_config);

    gpio_pin_config_t LED_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 9)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_LED_GREEN_GPIO, BOARD_INITDEBUG_UARTPINS_LED_GREEN_PORT, BOARD_INITDEBUG_UARTPINS_LED_GREEN_PIN, &LED_GREEN_config);

    gpio_pin_config_t ULTRASON_1_TRIG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 10)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_GPIO, BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_PORT, BOARD_INITDEBUG_UARTPINS_ULTRASON_1_TRIG_PIN, &ULTRASON_1_TRIG_config);

    gpio_pin_config_t ULTRASON_1_ECHO_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin 40)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_ULTRASON_1_ECHO_GPIO, BOARD_INITDEBUG_UARTPINS_ULTRASON_1_ECHO_PORT, BOARD_INITDEBUG_UARTPINS_ULTRASON_1_ECHO_PIN, &ULTRASON_1_ECHO_config);

    gpio_pin_config_t MOTOR_B_DIRECTION_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 68)  */
    GPIO_PinInit(BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_GPIO, BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PORT, BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PIN, &MOTOR_B_DIRECTION_config);
    /* Ctimer input 0 is selected for Secure TIMER2 CAPTSEL 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_CtimerInp0ToTimer2Captsel);

    IOCON->PIO[0][1] = ((IOCON->PIO[0][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT01 (pin 7) is configured as CT_INP0. */
                        | IOCON_PIO_FUNC(PIO0_1_FUNC_ALT3)

